; Handles ability localization. Uses the game's own UI colors. (UIUtilities_Colors.uc)
; "GOOD" (#53b45e) = good stats           |           "WARNING2" (#e69831) = bad stats
; ----------------------------------------^-------------------------------------------

;-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>
;<>-<>-<>-<>-<>-<>-<>-<>          CHARACTER ABILITIES          <>-<>-<>-<>-<>-<>-<>-<>
;-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>
[XAaA_NextGenPropellant X2AbilityTemplate]
LocFriendlyName="下一代推进剂"
LocLongDescription="你的化学喷射器能将火焰投射到更远的距离，但喷射范围更窄。它们还能造成额外的<font color=\"#53b45e\"><Ability:XAAA_NEXT_GEN_PROPELLANT_DAMAGE_MODIFIER/> 伤害</font>. 禁止使用长度可调的喷嘴."
LocHelpText="你的化学喷射器能将火焰投射到更远的距离，但喷射范围更窄。它们还能造成额外的<font color=\"#53b45e\"><Ability:XAAA_NEXT_GEN_PROPELLANT_DAMAGE_MODIFIER/> 伤害</font>. 禁止使用长度可调的喷嘴."
LocFlyOverText="下一代推进剂"
LocPromotionPopupText="<Bullet/>有效射程被延长了<font color=\"#53b45e\"><Ability:XAAA_NEXT_GEN_PROPELLANT_CONE_LENGTH_MODIFIER/></font>格子，但喷射锥形是<font color=\"#e69831\"><Ability:XAAA_NEXT_GEN_PROPELLANT_CONE_WIDTH_MODIFIER/></font>更窄的格子.<br/><Bullet/>范围加成对所有化学喷射器都有效，但需要焚化者才能正确显示.<br/><Bullet/>光束和磁性层级的伤害加成也适用于其下方的激光和线圈层级."

[XAaA_AllFiredUp X2AbilityTemplate]
LocFriendlyName="热血沸腾"
LocLongDescription="授予火焰伤害免疫。你的所有攻击都会<font color=\"#53b45e\">+<Ability:XAAA_ALL_FIRED_UP_DAMAGE_MODIFIER/> 伤害</font>当主动站在火中时."
LocHelpText="授予火焰伤害免疫。你的所有攻击都会<font color=\"#53b45e\">+<Ability:XAAA_ALL_FIRED_UP_DAMAGE_MODIFIER/> 伤害</font>当主动站在火中时."
LocFlyOverText="热血沸腾"
LocPromotionPopupText="<Bullet/>这个效果也适用于该角色所造成的任何持续伤害叠加.<br/><Bullet/>光束和磁性层级的伤害加成也适用于其下方的激光和线圈层级."

[XAaA_UnstoppableForce X2AbilityTemplate]
LocFriendlyName="不可阻挡的力量"
LocLongDescription="专注：初始拥有一点。每回合额外获得一点。专注超过2点时提升移动力，但低于2点时则会产生负面效果. (<font color=\"#e69831\">-4</font>/<font color=\"#e69831\">-2</font>/0/<font color=\"#53b45e\">+1</font>/<font color=\"#53b45e\">+2</font>/<font color=\"#53b45e\">+3</font>/<font color=\"#53b45e\">+4</font>/<font color=\"#53b45e\">+5</font>)"
LocHelpText="专注：初始拥有一点。每回合额外获得一点。专注超过2点时提升移动力，但低于2点时则会产生负面效果. (<font color=\"#e69831\">-4</font>/<font color=\"#e69831\">-2</font>/0/<font color=\"#53b45e\">+1</font>/<font color=\"#53b45e\">+2</font>/<font color=\"#53b45e\">+3</font>/<font color=\"#53b45e\">+4</font>/<font color=\"#53b45e\">+5</font>)"
LocFlyOverText="不可阻挡的力量"
LocPromotionPopupText="<Bullet/明智地使用你的的专注点数！消耗过多可能会让你陷入暴露和脆弱的境地.<br/><Bullet/>战斗开始时移动力降低2点，但一回合过后就会恢复正常."


;-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>
;<>-<>-<>-<>-<>-<>-<>-<>    WEAPON SLOT ABILITIES W/ EFFECT    <>-<>-<>-<>-<>-<>-<>-<>
;-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>

; For abilities with both normal and passive variants, please use the _Passive ones!
; The main ability is automatically called when we need to apply effects to a target.
[XAaA_Enflamer_10_Passive X2AbilityTemplate]
LocFriendlyName = "燃烧者 (10%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>有一个<font color=\"#53b45e\">10%使敌人燃烧的几率</font>, 造成 <font color=\"#53b45e\"><Ability:XAAA_ENFLAMER_10_BURN_DAMAGE/>持续两回合的伤害</font>并限制某些技能."
[XAaA_Enflamer_10 X2AbilityTemplate]
LocFriendlyName = "燃烧者 (10%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>有一个<font color=\"#53b45e\">10%使敌人燃烧的几率</font>, 造成 <font color=\"#53b45e\"><Ability:XAAA_ENFLAMER_10_BURN_DAMAGE/>持续两回合的伤害</font>并限制某些技能."

[XAaA_Enflamer_20_Passive X2AbilityTemplate]
LocFriendlyName = "燃烧者 (20%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>有一个<font color=\"#53b45e\">20%使敌人燃烧的几率</font>, 造成 <font color=\"#53b45e\"><Ability:XAAA_ENFLAMER_20_BURN_DAMAGE/>持续两回合的伤害</font>并限制某些技能."
[XAaA_Enflamer_20 X2AbilityTemplate]
LocFriendlyName = "燃烧者 (20%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>有一个<font color=\"#53b45e\">20%使敌人燃烧的几率</font>, 造成 <font color=\"#53b45e\"><Ability:XAAA_ENFLAMER_20_BURN_DAMAGE/>持续两回合的伤害</font>并限制某些技能."

[XAaA_Enflamer_33_Passive X2AbilityTemplate]
LocFriendlyName = "燃烧者 (33%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>有一个<font color=\"#53b45e\">33%使敌人燃烧的几率</font>, 造成 <font color=\"#53b45e\"><Ability:XAAA_ENFLAMER_33_BURN_DAMAGE/>持续两回合的伤害</font>并限制某些技能."
[XAaA_Enflamer_33 X2AbilityTemplate]
LocFriendlyName = "燃烧者 (33%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>有一个<font color=\"#53b45e\">33%使敌人燃烧的几率</font>, 造成 <font color=\"#53b45e\"><Ability:XAAA_ENFLAMER_33_BURN_DAMAGE/>持续两回合的伤害</font>并限制某些技能."

[XAaA_Enflamer_50_Passive X2AbilityTemplate]
LocFriendlyName = "燃烧者 (50%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>有一个<font color=\"#53b45e\">50%使敌人燃烧的几率</font>, 造成 <font color=\"#53b45e\"><Ability:XAAA_ENFLAMER_50_BURN_DAMAGE/>持续两回合的伤害</font>并限制某些技能."
[XAaA_Enflamer_50 X2AbilityTemplate]
LocFriendlyName = "燃烧者 (50%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>有一个<font color=\"#53b45e\">50%使敌人燃烧的几率</font>, 造成 <font color=\"#53b45e\"><Ability:XAAA_ENFLAMER_50_BURN_DAMAGE/>持续两回合的伤害</font>并限制某些技能."

[XAaA_Enflamer_100_Passive X2AbilityTemplate]
LocFriendlyName = "燃烧者 (100%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>是<font color=\"#53b45e\">guaranteed to set vulnerable foes aflame</font>. Deals <font color=\"#53b45e\"><Ability:XAAA_ENFLAMER_100_BURN_DAMAGE/>持续两回合的伤害</font>, blocking certain 行动."
[XAaA_Enflamer_100 X2AbilityTemplate]
LocFriendlyName = "燃烧者 (100%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>是<font color=\"#53b45e\">guaranteed to set vulnerable foes aflame</font>. Deals <font color=\"#53b45e\"><Ability:XAAA_ENFLAMER_100_BURN_DAMAGE/>持续两回合的伤害</font>, blocking certain 行动."

[XAaA_Conflagrator_10_Passive X2AbilityTemplate]
LocFriendlyName = "纵火者 (10%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>有一个<font color=\"#53b45e\">10%使敌人燃烧的几率</font>, 造成 <font color=\"#53b45e\"><Ability:XAAA_CONFLAGRATOR_10_BURN_DAMAGE/>持续两回合的伤害</font>并限制某些技能."
[XAaA_Conflagrator_10 X2AbilityTemplate]
LocFriendlyName = "纵火者 (10%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>有一个<font color=\"#53b45e\">10%使敌人燃烧的几率</font>, 造成 <font color=\"#53b45e\"><Ability:XAAA_CONFLAGRATOR_10_BURN_DAMAGE/>持续两回合的伤害</font>并限制某些技能."

[XAaA_Conflagrator_20_Passive X2AbilityTemplate]
LocFriendlyName = "纵火者 (20%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>有一个<font color=\"#53b45e\">20%使敌人燃烧的几率</font>, 造成 <font color=\"#53b45e\"><Ability:XAAA_CONFLAGRATOR_20_BURN_DAMAGE/>持续两回合的伤害</font>并限制某些技能."
[XAaA_Conflagrator_20 X2AbilityTemplate]
LocFriendlyName = "纵火者 (20%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>有一个<font color=\"#53b45e\">20%使敌人燃烧的几率</font>, 造成 <font color=\"#53b45e\"><Ability:XAAA_CONFLAGRATOR_20_BURN_DAMAGE/>持续两回合的伤害</font>并限制某些技能."

[XAaA_Conflagrator_33_Passive X2AbilityTemplate]
LocFriendlyName = "纵火者 (33%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>有一个<font color=\"#53b45e\">33%使敌人燃烧的几率</font>, 造成 <font color=\"#53b45e\"><Ability:XAAA_CONFLAGRATOR_33_BURN_DAMAGE/>持续两回合的伤害</font>并限制某些技能."
[XAaA_Conflagrator_33 X2AbilityTemplate]
LocFriendlyName = "纵火者 (33%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>有一个<font color=\"#53b45e\">33%使敌人燃烧的几率</font>, 造成 <font color=\"#53b45e\"><Ability:XAAA_CONFLAGRATOR_33_BURN_DAMAGE/>持续两回合的伤害</font>并限制某些技能."

[XAaA_Conflagrator_50_Passive X2AbilityTemplate]
LocFriendlyName = "纵火者 (50%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>有一个<font color=\"#53b45e\">50%使敌人燃烧的几率</font>, 造成 <font color=\"#53b45e\"><Ability:XAAA_CONFLAGRATOR_50_BURN_DAMAGE/>持续两回合的伤害</font>并限制某些技能."
[XAaA_Conflagrator_50 X2AbilityTemplate]
LocFriendlyName = "纵火者 (50%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>有一个<font color=\"#53b45e\">50%使敌人燃烧的几率</font>, 造成 <font color=\"#53b45e\"><Ability:XAAA_CONFLAGRATOR_50_BURN_DAMAGE/>持续两回合的伤害</font>并限制某些技能."

[XAaA_Conflagrator_100_Passive X2AbilityTemplate]
LocFriendlyName = "纵火者 (100%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>是<font color=\"#53b45e\">guaranteed to set vulnerable foes ablaze</font>. Deals <font color=\"#53b45e\"><Ability:XAAA_CONFLAGRATOR_100_BURN_DAMAGE/>持续两回合的伤害</font>, blocking certain 行动."
[XAaA_Conflagrator_100 X2AbilityTemplate]
LocFriendlyName = "纵火者 (100%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>是<font color=\"#53b45e\">guaranteed to set vulnerable foes ablaze</font>. Deals <font color=\"#53b45e\"><Ability:XAAA_CONFLAGRATOR_100_BURN_DAMAGE/>持续两回合的伤害</font>, blocking certain 行动."

[XAaA_Disabler_10_Passive X2AbilityTemplate]
LocFriendlyName = "Disabler (10%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>有一个<font color=\"#53b45e\">10%几率使目标昏迷持续<Ability:XAAA_DISABLER_10_STUN_ACTIONS/> 行动</font>击中时."
[XAaA_Disabler_10 X2AbilityTemplate]
LocFriendlyName = "Disabler (10%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>有一个<font color=\"#53b45e\">10%几率使目标昏迷持续<Ability:XAAA_DISABLER_10_STUN_ACTIONS/> 行动</font>击中时."

[XAaA_Disabler_20_Passive X2AbilityTemplate]
LocFriendlyName = "Disabler (20%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>有一个<font color=\"#53b45e\">20%几率使目标昏迷持续<Ability:XAAA_DISABLER_20_STUN_ACTIONS/> 行动</font>击中时."
[XAaA_Disabler_20 X2AbilityTemplate]
LocFriendlyName = "Disabler (20%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>有一个<font color=\"#53b45e\">20%几率使目标昏迷持续<Ability:XAAA_DISABLER_20_STUN_ACTIONS/> 行动</font>击中时."

[XAaA_Disabler_33_Passive X2AbilityTemplate]
LocFriendlyName = "Disabler (33%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>有一个<font color=\"#53b45e\">33%几率使目标昏迷持续<Ability:XAAA_DISABLER_33_STUN_ACTIONS/> 行动</font>击中时."
[XAaA_Disabler_33 X2AbilityTemplate]
LocFriendlyName = "Disabler (33%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>有一个<font color=\"#53b45e\">33%几率使目标昏迷持续<Ability:XAAA_DISABLER_33_STUN_ACTIONS/> 行动</font>击中时."

[XAaA_Disabler_50_Passive X2AbilityTemplate]
LocFriendlyName = "Disabler (50%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>有一个<font color=\"#53b45e\">50%几率使目标昏迷持续<Ability:XAAA_DISABLER_50_STUN_ACTIONS/> 行动</font>击中时."
[XAaA_Disabler_50 X2AbilityTemplate]
LocFriendlyName = "Disabler (50%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>有一个<font color=\"#53b45e\">50%几率使目标昏迷持续<Ability:XAAA_DISABLER_50_STUN_ACTIONS/> 行动</font>击中时."

[XAaA_Disabler_100_Passive X2AbilityTemplate]
LocFriendlyName = "Disabler (100%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>是<font color=\"#53b45e\">必定会使目标昏迷持续<Ability:XAAA_DISABLER_100_STUN_ACTIONS/> 行动</font>击中时."
[XAaA_Disabler_100 X2AbilityTemplate]
LocFriendlyName = "Disabler (100%)"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>是<font color=\"#53b45e\">必定会使目标昏迷持续<Ability:XAAA_DISABLER_100_STUN_ACTIONS/> 行动</font>击中时."

[XAaA_IntegratedShield_CV X2AbilityTemplate]
LocFriendlyName = "集成护盾(T1)"
LocLongDescription = "个直接内置的大型面罩<Ability:XAAA_WEAPON_NAME/> 增加 <font color=\"#53b45e\">+<Ability:XAAA_INTEGRATED_SHIELD_ABLATIVE_MODIFIER/>牺牲性生命值</font>在战斗开始时."

[XAaA_IntegratedShield_MG X2AbilityTemplate]
LocFriendlyName = "集成护盾(T2)"
LocLongDescription = "个直接内置的大型面罩<Ability:XAAA_WEAPON_NAME/> 增加 <font color=\"#53b45e\">+<Ability:XAAA_INTEGRATED_SHIELD_ABLATIVE_MODIFIER/>牺牲性生命值</font>在战斗开始时."
	
[XAaA_IntegratedShield_BM X2AbilityTemplate]
LocFriendlyName = "集成护盾(T3)"
LocLongDescription = "个直接内置的大型面罩<Ability:XAAA_WEAPON_NAME/> 增加 <font color=\"#53b45e\">+<Ability:XAAA_INTEGRATED_SHIELD_ABLATIVE_MODIFIER/>牺牲性生命值</font>在战斗开始时."

[XAaA_HighEncumbrance X2AbilityTemplate]
LocFriendlyName = "高负重"
LocLongDescription = "比大多数都重, <Ability:XAAA_WEAPON_NAME/> <font color=\"#e69831\">降低移动力<Ability:XAAA_HIGH_ENCUMBRANCE_MOBILITY_MODIFIER/></font>, 并使你<font color=\"#e69831\"><Ability:XAAA_HIGH_ENCUMBRANCE_DETECTION_MODIFIER/>被发现的几率提高了%</font>从隐蔽处."

[XAaA_ExtremeEncumbrance X2AbilityTemplate]
LocFriendlyName = "极度负重"
LocLongDescription = "极其沉重, <Ability:XAAA_WEAPON_NAME/> <font color=\"#e69831\">降低移动力<Ability:XAAA_EXTREME_ENCUMBRANCE_MOBILITY_MODIFIER/></font>, 并使你<font color=\"#e69831\"><Ability:XAAA_EXTREME_ENCUMBRANCE_DETECTION_MODIFIER/>被发现的几率提高了%</font>从隐蔽处."

[XAaA_LightArms X2AbilityTemplate]
LocFriendlyName = "轻武器"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>额外赋予<font color=\"#53b45e\">+<Ability:XAAA_LIGHT_ARMS_MOBILITY_MODIFIER/>移动力</font>, 并使你<font color=\"#53b45e\"><Ability:XAAA_LIGHT_ARMS_DETECTION_MODIFIER/>被发现的几率降低了%</font>从隐蔽处."

[XAaA_HeavySidearm X2AbilityTemplate]
LocFriendlyName = "重型副武器"
LocLongDescription = "Carrying <Ability:XAAA_WEAPON_NAME/> incurs a <font color=\"#e69831\">-<Ability:XAAA_HEAVY_SIDEARM_MOBILITY_MODIFIER/>移动力</font> penalty, 并使你<font color=\"#e69831\"><Ability:XAAA_HEAVY_SIDEARM_DETECTION_MODIFIER/>被发现的几率提高了%</font>从隐蔽处."

[XAaA_HighEncumbrance_Shield X2AbilityTemplate]
LocFriendlyName = "高负重"
LocLongDescription = "比大多数都重, <Ability:XAAA_SHIELD_NAME/> <font color=\"#e69831\">降低移动力<Ability:XAAA_HIGH_ENCUMBRANCE_MOBILITY_MODIFIER/></font>, 并使你<font color=\"#e69831\"><Ability:XAAA_HIGH_ENCUMBRANCE_DETECTION_MODIFIER/>被发现的几率提高了%</font>从隐蔽处."

[XAaA_ExtremeEncumbrance_Shield X2AbilityTemplate]
LocFriendlyName = "极度负重"
LocLongDescription = "极其沉重, <Ability:XAAA_SHIELD_NAME/> <font color=\"#e69831\">降低移动力<Ability:XAAA_EXTREME_ENCUMBRANCE_MOBILITY_MODIFIER/></font>, 并使你<font color=\"#e69831\"><Ability:XAAA_EXTREME_ENCUMBRANCE_DETECTION_MODIFIER/>被发现的几率提高了%</font>从隐蔽处."


;-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>
;<>-<>-<>-<>-<>-<>-<>-<>       ARMOR ABILITIES W/ EFFECT       <>-<>-<>-<>-<>-<>-<>-<>
;-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>

; Name is supported, but not used by default as the ability is hidden in combat.
[XAaA_AblativePlating_T1 X2AbilityTemplate]
LocFriendlyName = "可消耗装甲(T1)"
LocLongDescription = "一种坚固的牺牲性外壳能够削弱来袭的冲击，从而赋予<font color=\"#53b45e\">+<Ability:XAAA_ABLATIVE_PLATING_T1_ABLATIVE_MODIFIER/>牺牲性生命值</font>在战斗开始时."

; Name is supported, but not used by default as the ability is hidden in combat.
[XAaA_AblativePlating_T2 X2AbilityTemplate]
LocFriendlyName = "可消耗装甲(T2)"
LocLongDescription = "一种坚固的牺牲性外壳能够削弱来袭的冲击，从而赋予<font color=\"#53b45e\">+<Ability:XAAA_ABLATIVE_PLATING_T2_ABLATIVE_MODIFIER/>牺牲性生命值</font>在战斗开始时."
	
; Name is supported, but not used by default as the ability is hidden in combat.
[XAaA_AblativePlating_T3 X2AbilityTemplate]
LocFriendlyName = "可消耗装甲(T3)"
LocLongDescription = "一种坚固的牺牲性外壳能够削弱来袭的冲击，从而赋予<font color=\"#53b45e\">+<Ability:XAAA_ABLATIVE_PLATING_T3_ABLATIVE_MODIFIER/>牺牲性生命值</font>在战斗开始时."

[XAaA_HighEncumbrance_Armor X2AbilityTemplate]
LocFriendlyName = "高负重"
LocLongDescription = "比大多数都重, <Ability:XAAA_ARMOR_NAME/> <font color=\"#e69831\">降低移动力<Ability:XAAA_HIGH_ENCUMBRANCE_MOBILITY_MODIFIER/></font>, 并使你<font color=\"#e69831\"><Ability:XAAA_HIGH_ENCUMBRANCE_DETECTION_MODIFIER/>被发现的几率提高了%</font>从隐蔽处."

[XAaA_ExtremeEncumbrance_Armor X2AbilityTemplate]
LocFriendlyName = "极度负重"
LocLongDescription = "极其沉重, <Ability:XAAA_ARMOR_NAME/> <font color=\"#e69831\">降低移动力<Ability:XAAA_EXTREME_ENCUMBRANCE_MOBILITY_MODIFIER/></font>, 并使你<font color=\"#e69831\"><Ability:XAAA_EXTREME_ENCUMBRANCE_DETECTION_MODIFIER/>被发现的几率提高了%</font>从隐蔽处."

[XAaA_LightOutfit X2AbilityTemplate]
LocFriendlyName = "轻便装备"
LocLongDescription = "<Ability:XAAA_ARMOR_NAME_FIRST/>额外赋予<font color=\"#53b45e\">+<Ability:XAAA_LIGHT_OUTFIT_MOBILITY_MODIFIER/> 移动力</font>, 并使你<font color=\"#53b45e\"><Ability:XAAA_LIGHT_OUTFIT_DETECTION_MODIFIER/>被发现的几率降低了%</font>从隐蔽处."


;-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>
;<>-<>-<>-<>-<>-<>-<>-<>      WEAPON ABILITIES, LORE ONLY      <>-<>-<>-<>-<>-<>-<>-<>
;-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>

[XAaA_RangeProfile_Flat_LoreOnly X2AbilityTemplate]
LocFriendlyName = "范围：任意"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>在任何范围内都保持基准效力，没有明显的优势或劣势."

[XAaA_RangeProfile_FlatBelow15_LoreOnly X2AbilityTemplate]
LocFriendlyName = "范围: 15米"
LocLongDescription = "所采用的独特射击方法 <Ability:XAAA_WEAPON_NAME/>施加了一个严格的<font color=\"#e69831\">15格限制</font>在有效范围内.

[XAaA_RangeProfile_FlatBelow20_LoreOnly X2AbilityTemplate]
LocFriendlyName = "范围: 20米"
LocLongDescription = "所采用的独特射击方法 <Ability:XAAA_WEAPON_NAME/>施加了一个严格的<font color=\"#e69831\">20格限制</font>在有效范围内.

[XAaA_RangeProfile_VeryShort_LoreOnly X2AbilityTemplate]
LocFriendlyName = "范围:近距离"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>是<font color=\"#e69831\">只能在近距离使用</font>, 仅几米开外准确率就会迅速下降.

[XAaA_RangeProfile_Short_LoreOnly X2AbilityTemplate]
LocFriendlyName = "范围: 短"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>是<font color=\"#e69831\">仅用于近战格斗</font>, 在远距离时准确率大幅下降."

[XAaA_RangeProfile_ShortExtended_LoreOnly X2AbilityTemplate]
LocFriendlyName = "范围: 短程扩展"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/> <font color=\"#e69831\">在近战格斗中效果最好</font>, 但在中程范围内仍保留一定效力."

[XAaA_RangeProfile_Medium_LoreOnly X2AbilityTemplate]
LocFriendlyName = "范围: 中等"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>是<font color=\"#53b45e\">在任何范围内都有效</font>, 在更远的距离上，准确率逐渐趋于稳定."

[XAaA_RangeProfile_Vektor_LoreOnly X2AbilityTemplate]
LocFriendlyName = "范围: 中等扩展"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>是<font color=\"#53b45e\">在任何范围内都有效</font>, 直到非常远的距离都保持着极高的准确率."

[XAaA_RangeProfile_LenientLong_LoreOnly X2AbilityTemplate]
LocFriendlyName = "范围: 扩展的长距离"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>是<font color=\"#e69831\">最适合在远距离使用</font>像大多数狙击步枪一样，但近距离受到的惩罚不那么严厉."

[XAaA_RangeProfile_Long_LoreOnly X2AbilityTemplate]
LocFriendlyName = "范围: 长"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>是<font color=\"#e69831\">除了远距离，什么都没用</font>, 完全依靠操作员的技能进行干净的射击."

; Not shown in combat by default.
; Do not rely on the name tag, this ability is custom-designed for a specific weapon.
; Deliberately kept vague ("this unit" instead of "the SPARK") to fit mod setups like MECs.
[XAaA_EleriumSystemsIntegration_LoreOnly X2AbilityTemplate]
LocFriendlyName = "元素系统集成"
LocLongDescription = "直接从该单位的元素能量系统中获取能量，对原始的桀斯超级武器进行了大幅度的改造，使其能够在战斗中重新装弹，但代价是降低了伤害输出."

; Not shown in combat by default.
[XAaA_HighModularity_LoreOnly X2AbilityTemplate]
LocFriendlyName = "高度模块化"
LocLongDescription = "<Ability:XAAA_WEAPON_NAME_FIRST/>提供空间<font color=\"#53b45e\">额外升级</font>."

[XAaA_ExplosiveMunitions_LoreOnly X2AbilityTemplate]
LocFriendlyName = "爆炸性弹药"
LocLongDescription = "射击<Ability:XAAA_WEAPON_NAME/>不仅撕碎护甲，而且<font color=\"#53b45e\">对地形造成更多伤害</font>, 允许."

[XAaA_MinimalPenetration_LoreOnly X2AbilityTemplate]
LocFriendlyName = "最小穿透力"
LocLongDescription = "向护甲开火时, <Ability:XAAA_WEAPON_NAME/>造成<font color=\"#e69831\">减少 1 次伤害</font>."

[XAaA_QuietOperation_LoreOnly X2AbilityTemplate]
LocFriendlyName = "安静运行"
LocLongDescription = "射击<Ability:XAAA_WEAPON_NAME/>可能 <font color=\"#53b45e\">吸引较少的注意力</font>."

[XAaA_OffHanded_LoreOnly X2AbilityTemplate]
LocFriendlyName = "随意"
LocLongDescription = "随意射击<Ability:XAAA_WEAPON_NAME/>造成<font color=\"#e69831\">-10 aim</font>攻击"

; Really just made to work around an issue with the UI not showing sawed-off ammo.
[XAaA_ExtraShots_LoreOnly X2AbilityTemplate]
LocFriendlyName = "额外镜头"
LocLongDescription = "与大多数相比, <Ability:XAAA_WEAPON_NAME/> 带有 <font color=\"#53b45e\">额外两回合</font>."


;-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>
;<>-<>-<>-<>-<>-<>-<>-<>      ARMOR ABILITIES (LORE ONLY)      <>-<>-<>-<>-<>-<>-<>-<>
;-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>-<>

; Not shown in combat by default.
[XAaA_HighModularity_Armor_LoreOnly X2AbilityTemplate]
LocFriendlyName = "高度模块化"
LocLongDescription = "<Ability:XAAA_ARMOR_NAME_FIRST/>提供空间<font color=\"#53b45e\">额外升级</font>."